//Написати функцію, яка посортує масив вставкою

exports.insertionSort=(a)=>{
    var n = a.length;
    for (var i=0; i<n; i++){ // виконується для кожного елeмента масиву
      var v = a[i], j = i-1; // визначається значення елемента та індекс поперенього
      while(j >= 0 && a[j] > v){ // поки індекс попереднього елемента >=0 і його значення більше поточного елемента
        a[j+1] = a[j]; //значенням наступного за поточним елемента масиву стає значення попереднього елемента
        
        j--; 
      }
      a[j+1] = v; //значенням наступного за поточним елемента масиву стає значення поточного елемента
           
    }
    return a;
  };
 
